hybridMultiphaseFoamV7/tutorials/DarcyFlowCases/Buckley-Leverett/gravityCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hybridMultiphaseFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3000; //150000;

deltaT          1e-5;

writeControl    adjustableRunTime; //timeStep

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.75;
maxAlphaCo      0.1;
maxDeltaT       1;

// ************************************************************************* //
